FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_usbhs.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71_USBHS_COMPONENT_
#define _SAMV71_USBHS_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR USB High-Speed Interface */
/* ============================================================================= */
/** \addtogroup SAMV71_USBHS USB High-Speed Interface */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief UsbhsDevdma hardware registers */
    typedef struct
    {
        __IO uint32_t USBHS_DEVDMANXTDSC;  /**< \brief (UsbhsDevdma Offset: 0x0) Device DMA Channel Next Descriptor Address Register */
        __IO uint32_t USBHS_DEVDMAADDRESS; /**< \brief (UsbhsDevdma Offset: 0x4) Device DMA Channel Address Register */
        __IO uint32_t USBHS_DEVDMACONTROL; /**< \brief (UsbhsDevdma Offset: 0x8) Device DMA Channel Control Register */
        __IO uint32_t USBHS_DEVDMASTATUS;  /**< \brief (UsbhsDevdma Offset: 0xC) Device DMA Channel Status Register */
    } UsbhsDevdma;
/** \brief UsbhsHstdma hardware registers */
    typedef struct
    {
        __IO uint32_t USBHS_HSTDMANXTDSC;  /**< \brief (UsbhsHstdma Offset: 0x0) Host DMA Channel Next Descriptor Address Register */
        __IO uint32_t USBHS_HSTDMAADDRESS; /**< \brief (UsbhsHstdma Offset: 0x4) Host DMA Channel Address Register */
        __IO uint32_t USBHS_HSTDMACONTROL; /**< \brief (UsbhsHstdma Offset: 0x8) Host DMA Channel Control Register */
        __IO uint32_t USBHS_HSTDMASTATUS;  /**< \brief (UsbhsHstdma Offset: 0xC) Host DMA Channel Status Register */
    } UsbhsHstdma;
/** \brief Usbhs hardware registers */
    #define USBHSDEVDMA_NUMBER    7
    #define USBHSHSTDMA_NUMBER    7
    typedef struct
    {
        __IO uint32_t USBHS_DEVCTRL;                    /**< \brief (Usbhs Offset: 0x0000) Device General Control Register */
        __I uint32_t USBHS_DEVISR;                      /**< \brief (Usbhs Offset: 0x0004) Device Global Interrupt Status Register */
        __O uint32_t USBHS_DEVICR;                      /**< \brief (Usbhs Offset: 0x0008) Device Global Interrupt Clear Register */
        __O uint32_t USBHS_DEVIFR;                      /**< \brief (Usbhs Offset: 0x000C) Device Global Interrupt Set Register */
        __I uint32_t USBHS_DEVIMR;                      /**< \brief (Usbhs Offset: 0x0010) Device Global Interrupt Mask Register */
        __O uint32_t USBHS_DEVIDR;                      /**< \brief (Usbhs Offset: 0x0014) Device Global Interrupt Disable Register */
        __O uint32_t USBHS_DEVIER;                      /**< \brief (Usbhs Offset: 0x0018) Device Global Interrupt Enable Register */
        __IO uint32_t USBHS_DEVEPT;                     /**< \brief (Usbhs Offset: 0x001C) Device Endpoint Register */
        __I uint32_t USBHS_DEVFNUM;                     /**< \brief (Usbhs Offset: 0x0020) Device Frame Number Register */
        __I uint32_t Reserved1[ 55 ];
        __IO uint32_t USBHS_DEVEPTCFG[ 10 ];            /**< \brief (Usbhs Offset: 0x100) Device Endpoint Configuration Register (n = 0) */
        __I uint32_t Reserved2[ 2 ];
        __I uint32_t USBHS_DEVEPTISR[ 10 ];             /**< \brief (Usbhs Offset: 0x130) Device Endpoint Status Register (n = 0) */
        __I uint32_t Reserved3[ 2 ];
        __O uint32_t USBHS_DEVEPTICR[ 10 ];             /**< \brief (Usbhs Offset: 0x160) Device Endpoint Clear Register (n = 0) */
        __I uint32_t Reserved4[ 2 ];
        __O uint32_t USBHS_DEVEPTIFR[ 10 ];             /**< \brief (Usbhs Offset: 0x190) Device Endpoint Set Register (n = 0) */
        __I uint32_t Reserved5[ 2 ];
        __I uint32_t USBHS_DEVEPTIMR[ 10 ];             /**< \brief (Usbhs Offset: 0x1C0) Device Endpoint Mask Register (n = 0) */
        __I uint32_t Reserved6[ 2 ];
        __O uint32_t USBHS_DEVEPTIER[ 10 ];             /**< \brief (Usbhs Offset: 0x1F0) Device Endpoint Enable Register (n = 0) */
        __I uint32_t Reserved7[ 2 ];
        __O uint32_t USBHS_DEVEPTIDR[ 10 ];             /**< \brief (Usbhs Offset: 0x220) Device Endpoint Disable Register (n = 0) */
        __I uint32_t Reserved8[ 50 ];
        UsbhsDevdma USBHS_DEVDMA[ USBHSDEVDMA_NUMBER ]; /**< \brief (Usbhs Offset: 0x310) n = 1 .. 7 */
        __I uint32_t Reserved9[ 32 ];
        __IO uint32_t USBHS_HSTCTRL;                    /**< \brief (Usbhs Offset: 0x0400) Host General Control Register */
        __I uint32_t USBHS_HSTISR;                      /**< \brief (Usbhs Offset: 0x0404) Host Global Interrupt Status Register */
        __O uint32_t USBHS_HSTICR;                      /**< \brief (Usbhs Offset: 0x0408) Host Global Interrupt Clear Register */
        __O uint32_t USBHS_HSTIFR;                      /**< \brief (Usbhs Offset: 0x040C) Host Global Interrupt Set Register */
        __I uint32_t USBHS_HSTIMR;                      /**< \brief (Usbhs Offset: 0x0410) Host Global Interrupt Mask Register */
        __O uint32_t USBHS_HSTIDR;                      /**< \brief (Usbhs Offset: 0x0414) Host Global Interrupt Disable Register */
        __O uint32_t USBHS_HSTIER;                      /**< \brief (Usbhs Offset: 0x0418) Host Global Interrupt Enable Register */
        __IO uint32_t USBHS_HSTPIP;                     /**< \brief (Usbhs Offset: 0x0041C) Host Pipe Register */
        __IO uint32_t USBHS_HSTFNUM;                    /**< \brief (Usbhs Offset: 0x0420) Host Frame Number Register */
        __IO uint32_t USBHS_HSTADDR1;                   /**< \brief (Usbhs Offset: 0x0424) Host Address 1 Register */
        __IO uint32_t USBHS_HSTADDR2;                   /**< \brief (Usbhs Offset: 0x0428) Host Address 2 Register */
        __IO uint32_t USBHS_HSTADDR3;                   /**< \brief (Usbhs Offset: 0x042C) Host Address 3 Register */
        __I uint32_t Reserved10[ 52 ];
        __IO uint32_t USBHS_HSTPIPCFG[ 10 ];            /**< \brief (Usbhs Offset: 0x500) Host Pipe Configuration Register (n = 0) */
        __I uint32_t Reserved11[ 2 ];
        __I uint32_t USBHS_HSTPIPISR[ 10 ];             /**< \brief (Usbhs Offset: 0x530) Host Pipe Status Register (n = 0) */
        __I uint32_t Reserved12[ 2 ];
        __O uint32_t USBHS_HSTPIPICR[ 10 ];             /**< \brief (Usbhs Offset: 0x560) Host Pipe Clear Register (n = 0) */
        __I uint32_t Reserved13[ 2 ];
        __O uint32_t USBHS_HSTPIPIFR[ 10 ];             /**< \brief (Usbhs Offset: 0x590) Host Pipe Set Register (n = 0) */
        __I uint32_t Reserved14[ 2 ];
        __I uint32_t USBHS_HSTPIPIMR[ 10 ];             /**< \brief (Usbhs Offset: 0x5C0) Host Pipe Mask Register (n = 0) */
        __I uint32_t Reserved15[ 2 ];
        __O uint32_t USBHS_HSTPIPIER[ 10 ];             /**< \brief (Usbhs Offset: 0x5F0) Host Pipe Enable Register (n = 0) */
        __I uint32_t Reserved16[ 2 ];
        __O uint32_t USBHS_HSTPIPIDR[ 10 ];             /**< \brief (Usbhs Offset: 0x620) Host Pipe Disable Register (n = 0) */
        __I uint32_t Reserved17[ 2 ];
        __IO uint32_t USBHS_HSTPIPINRQ[ 10 ];           /**< \brief (Usbhs Offset: 0x650) Host Pipe IN Request Register (n = 0) */
        __I uint32_t Reserved18[ 2 ];
        __IO uint32_t USBHS_HSTPIPERR[ 10 ];            /**< \brief (Usbhs Offset: 0x680) Host Pipe Error Register (n = 0) */
        __I uint32_t Reserved19[ 26 ];
        UsbhsHstdma USBHS_HSTDMA[ USBHSHSTDMA_NUMBER ]; /**< \brief (Usbhs Offset: 0x710) n = 1 .. 7 */
        __I uint32_t Reserved20[ 32 ];
        __IO uint32_t USBHS_CTRL;                       /**< \brief (Usbhs Offset: 0x0800) General Control Register */
        __I uint32_t USBHS_SR;                          /**< \brief (Usbhs Offset: 0x0804) General Status Register */
        __O uint32_t USBHS_SCR;                         /**< \brief (Usbhs Offset: 0x0808) General Status Clear Register */
        __O uint32_t USBHS_SFR;                         /**< \brief (Usbhs Offset: 0x080C) General Status Set Register */
        __IO uint32_t USBHS_TSTA1;                      /**< \brief (Usbhs Offset: 0x0810) General Test A1 Register */
        __IO uint32_t USBHS_TSTA2;                      /**< \brief (Usbhs Offset: 0x0814) General Test A2 Register */
        __I uint32_t USBHS_VERSION;                     /**< \brief (Usbhs Offset: 0x0818) General Version Register */
        __I uint32_t Reserved21[ 4 ];
        __I uint32_t USBHS_FSM;                         /**< \brief (Usbhs Offset: 0x082C) General Finite State Machine Register */
    } Usbhs;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- USBHS_DEVCTRL : (USBHS Offset: 0x0000) Device General Control Register -------- */
#define USBHS_DEVCTRL_UADD_Pos                   0
#define USBHS_DEVCTRL_UADD_Msk                   ( 0x7fu << USBHS_DEVCTRL_UADD_Pos )   /**< \brief (USBHS_DEVCTRL) USB Address */
#define USBHS_DEVCTRL_UADD( value )    ( ( USBHS_DEVCTRL_UADD_Msk & ( ( value ) << USBHS_DEVCTRL_UADD_Pos ) ) )
#define USBHS_DEVCTRL_ADDEN                      ( 0x1u << 7 )                         /**< \brief (USBHS_DEVCTRL) Address Enable */
#define USBHS_DEVCTRL_DETACH                     ( 0x1u << 8 )                         /**< \brief (USBHS_DEVCTRL) Detach */
#define USBHS_DEVCTRL_RMWKUP                     ( 0x1u << 9 )                         /**< \brief (USBHS_DEVCTRL) Remote Wake-Up */
#define USBHS_DEVCTRL_SPDCONF_Pos                10
#define USBHS_DEVCTRL_SPDCONF_Msk                ( 0x3u << USBHS_DEVCTRL_SPDCONF_Pos ) /**< \brief (USBHS_DEVCTRL) Mode Configuration */
#define USBHS_DEVCTRL_SPDCONF( value )    ( ( USBHS_DEVCTRL_SPDCONF_Msk & ( ( value ) << USBHS_DEVCTRL_SPDCONF_Pos ) ) )
#define   USBHS_DEVCTRL_SPDCONF_NORMAL           ( 0x0u << 10 )                        /**< \brief (USBHS_DEVCTRL) The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable. */
#define   USBHS_DEVCTRL_SPDCONF_LOW_POWER        ( 0x1u << 10 )                        /**< \brief (USBHS_DEVCTRL) For a better consumption, if high speed is not needed. */
#define   USBHS_DEVCTRL_SPDCONF_HIGH_SPEED       ( 0x2u << 10 )                        /**< \brief (USBHS_DEVCTRL) Forced high speed. */
#define   USBHS_DEVCTRL_SPDCONF_FORCED_FS        ( 0x3u << 10 )                        /**< \brief (USBHS_DEVCTRL) The peripheral remains in Full-speed mode whatever the host speed capability. */
#define USBHS_DEVCTRL_LS                         ( 0x1u << 12 )                        /**< \brief (USBHS_DEVCTRL) Low-Speed Mode Force */
#define USBHS_DEVCTRL_TSTJ                       ( 0x1u << 13 )                        /**< \brief (USBHS_DEVCTRL) Test mode J */
#define USBHS_DEVCTRL_TSTK                       ( 0x1u << 14 )                        /**< \brief (USBHS_DEVCTRL) Test mode K */
#define USBHS_DEVCTRL_TSTPCKT                    ( 0x1u << 15 )                        /**< \brief (USBHS_DEVCTRL) Test packet mode */
#define USBHS_DEVCTRL_OPMODE2                    ( 0x1u << 16 )                        /**< \brief (USBHS_DEVCTRL) Specific Operational mode */
/* -------- USBHS_DEVISR : (USBHS Offset: 0x0004) Device Global Interrupt Status Register -------- */
#define USBHS_DEVISR_SUSP                        ( 0x1u << 0 )                         /**< \brief (USBHS_DEVISR) Suspend Interrupt */
#define USBHS_DEVISR_MSOF                        ( 0x1u << 1 )                         /**< \brief (USBHS_DEVISR) Micro Start of Frame Interrupt */
#define USBHS_DEVISR_SOF                         ( 0x1u << 2 )                         /**< \brief (USBHS_DEVISR) Start of Frame Interrupt */
#define USBHS_DEVISR_EORST                       ( 0x1u << 3 )                         /**< \brief (USBHS_DEVISR) End of Reset Interrupt */
#define USBHS_DEVISR_WAKEUP                      ( 0x1u << 4 )                         /**< \brief (USBHS_DEVISR) Wake-Up Interrupt */
#define USBHS_DEVISR_EORSM                       ( 0x1u << 5 )                         /**< \brief (USBHS_DEVISR) End of Resume Interrupt */
#define USBHS_DEVISR_UPRSM                       ( 0x1u << 6 )                         /**< \brief (USBHS_DEVISR) Upstream Resume Interrupt */
#define USBHS_DEVISR_PEP_0                       ( 0x1u << 12 )                        /**< \brief (USBHS_DEVISR) Endpoint 0 Interrupt */
#define USBHS_DEVISR_PEP_1                       ( 0x1u << 13 )                        /**< \brief (USBHS_DEVISR) Endpoint 1 Interrupt */
#define USBHS_DEVISR_PEP_2                       ( 0x1u << 14 )                        /**< \brief (USBHS_DEVISR) Endpoint 2 Interrupt */
#define USBHS_DEVISR_PEP_3                       ( 0x1u << 15 )                        /**< \brief (USBHS_DEVISR) Endpoint 3 Interrupt */
#define USBHS_DEVISR_PEP_4                       ( 0x1u << 16 )                        /**< \brief (USBHS_DEVISR) Endpoint 4 Interrupt */
#define USBHS_DEVISR_PEP_5                       ( 0x1u << 17 )                        /**< \brief (USBHS_DEVISR) Endpoint 5 Interrupt */
#define USBHS_DEVISR_PEP_6                       ( 0x1u << 18 )                        /**< \brief (USBHS_DEVISR) Endpoint 6 Interrupt */
#define USBHS_DEVISR_PEP_7                       ( 0x1u << 19 )                        /**< \brief (USBHS_DEVISR) Endpoint 7 Interrupt */
#define USBHS_DEVISR_PEP_8                       ( 0x1u << 20 )                        /**< \brief (USBHS_DEVISR) Endpoint 8 Interrupt */
#define USBHS_DEVISR_PEP_9                       ( 0x1u << 21 )                        /**< \brief (USBHS_DEVISR) Endpoint 9 Interrupt */
#define USBHS_DEVISR_PEP_10                      ( 0x1u << 22 )                        /**< \brief (USBHS_DEVISR) Endpoint 10 Interrupt */
#define USBHS_DEVISR_PEP_11                      ( 0x1u << 23 )                        /**< \brief (USBHS_DEVISR) Endpoint 11 Interrupt */
#define USBHS_DEVISR_DMA_1                       ( 0x1u << 25 )                        /**< \brief (USBHS_DEVISR) DMA Channel 1 Interrupt */
#define USBHS_DEVISR_DMA_2                       ( 0x1u << 26 )                        /**< \brief (USBHS_DEVISR) DMA Channel 2 Interrupt */
#define USBHS_DEVISR_DMA_3                       ( 0x1u << 27 )                        /**< \brief (USBHS_DEVISR) DMA Channel 3 Interrupt */
#define USBHS_DEVISR_DMA_4                       ( 0x1u << 28 )                        /**< \brief (USBHS_DEVISR) DMA Channel 4 Interrupt */
#define USBHS_DEVISR_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_DEVISR) DMA Channel 5 Interrupt */
#define USBHS_DEVISR_DMA_6                       ( 0x1u << 30 )                        /**< \brief (USBHS_DEVISR) DMA Channel 6 Interrupt */
#define USBHS_DEVISR_DMA_7                       ( 0x1u << 31 )                        /**< \brief (USBHS_DEVISR) DMA Channel 7 Interrupt */
/* -------- USBHS_DEVICR : (USBHS Offset: 0x0008) Device Global Interrupt Clear Register -------- */
#define USBHS_DEVICR_SUSPC                       ( 0x1u << 0 )                         /**< \brief (USBHS_DEVICR) Suspend Interrupt Clear */
#define USBHS_DEVICR_MSOFC                       ( 0x1u << 1 )                         /**< \brief (USBHS_DEVICR) Micro Start of Frame Interrupt Clear */
#define USBHS_DEVICR_SOFC                        ( 0x1u << 2 )                         /**< \brief (USBHS_DEVICR) Start of Frame Interrupt Clear */
#define USBHS_DEVICR_EORSTC                      ( 0x1u << 3 )                         /**< \brief (USBHS_DEVICR) End of Reset Interrupt Clear */
#define USBHS_DEVICR_WAKEUPC                     ( 0x1u << 4 )                         /**< \brief (USBHS_DEVICR) Wake-Up Interrupt Clear */
#define USBHS_DEVICR_EORSMC                      ( 0x1u << 5 )                         /**< \brief (USBHS_DEVICR) End of Resume Interrupt Clear */
#define USBHS_DEVICR_UPRSMC                      ( 0x1u << 6 )                         /**< \brief (USBHS_DEVICR) Upstream Resume Interrupt Clear */
/* -------- USBHS_DEVIFR : (USBHS Offset: 0x000C) Device Global Interrupt Set Register -------- */
#define USBHS_DEVIFR_SUSPS                       ( 0x1u << 0 )                         /**< \brief (USBHS_DEVIFR) Suspend Interrupt Set */
#define USBHS_DEVIFR_MSOFS                       ( 0x1u << 1 )                         /**< \brief (USBHS_DEVIFR) Micro Start of Frame Interrupt Set */
#define USBHS_DEVIFR_SOFS                        ( 0x1u << 2 )                         /**< \brief (USBHS_DEVIFR) Start of Frame Interrupt Set */
#define USBHS_DEVIFR_EORSTS                      ( 0x1u << 3 )                         /**< \brief (USBHS_DEVIFR) End of Reset Interrupt Set */
#define USBHS_DEVIFR_WAKEUPS                     ( 0x1u << 4 )                         /**< \brief (USBHS_DEVIFR) Wake-Up Interrupt Set */
#define USBHS_DEVIFR_EORSMS                      ( 0x1u << 5 )                         /**< \brief (USBHS_DEVIFR) End of Resume Interrupt Set */
#define USBHS_DEVIFR_UPRSMS                      ( 0x1u << 6 )                         /**< \brief (USBHS_DEVIFR) Upstream Resume Interrupt Set */
#define USBHS_DEVIFR_DMA_1                       ( 0x1u << 25 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 1 Interrupt Set */
#define USBHS_DEVIFR_DMA_2                       ( 0x1u << 26 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 2 Interrupt Set */
#define USBHS_DEVIFR_DMA_3                       ( 0x1u << 27 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 3 Interrupt Set */
#define USBHS_DEVIFR_DMA_4                       ( 0x1u << 28 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 4 Interrupt Set */
#define USBHS_DEVIFR_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 5 Interrupt Set */
#define USBHS_DEVIFR_DMA_6                       ( 0x1u << 30 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 6 Interrupt Set */
#define USBHS_DEVIFR_DMA_7                       ( 0x1u << 31 )                        /**< \brief (USBHS_DEVIFR) DMA Channel 7 Interrupt Set */
/* -------- USBHS_DEVIMR : (USBHS Offset: 0x0010) Device Global Interrupt Mask Register -------- */
#define USBHS_DEVIMR_SUSPE                       ( 0x1u << 0 )                         /**< \brief (USBHS_DEVIMR) Suspend Interrupt Mask */
#define USBHS_DEVIMR_MSOFE                       ( 0x1u << 1 )                         /**< \brief (USBHS_DEVIMR) Micro Start of Frame Interrupt Mask */
#define USBHS_DEVIMR_SOFE                        ( 0x1u << 2 )                         /**< \brief (USBHS_DEVIMR) Start of Frame Interrupt Mask */
#define USBHS_DEVIMR_EORSTE                      ( 0x1u << 3 )                         /**< \brief (USBHS_DEVIMR) End of Reset Interrupt Mask */
#define USBHS_DEVIMR_WAKEUPE                     ( 0x1u << 4 )                         /**< \brief (USBHS_DEVIMR) Wake-Up Interrupt Mask */
#define USBHS_DEVIMR_EORSME                      ( 0x1u << 5 )                         /**< \brief (USBHS_DEVIMR) End of Resume Interrupt Mask */
#define USBHS_DEVIMR_UPRSME                      ( 0x1u << 6 )                         /**< \brief (USBHS_DEVIMR) Upstream Resume Interrupt Mask */
#define USBHS_DEVIMR_PEP_0                       ( 0x1u << 12 )                        /**< \brief (USBHS_DEVIMR) Endpoint 0 Interrupt Mask */
#define USBHS_DEVIMR_PEP_1                       ( 0x1u << 13 )                        /**< \brief (USBHS_DEVIMR) Endpoint 1 Interrupt Mask */
#define USBHS_DEVIMR_PEP_2                       ( 0x1u << 14 )                        /**< \brief (USBHS_DEVIMR) Endpoint 2 Interrupt Mask */
#define USBHS_DEVIMR_PEP_3                       ( 0x1u << 15 )                        /**< \brief (USBHS_DEVIMR) Endpoint 3 Interrupt Mask */
#define USBHS_DEVIMR_PEP_4                       ( 0x1u << 16 )                        /**< \brief (USBHS_DEVIMR) Endpoint 4 Interrupt Mask */
#define USBHS_DEVIMR_PEP_5                       ( 0x1u << 17 )                        /**< \brief (USBHS_DEVIMR) Endpoint 5 Interrupt Mask */
#define USBHS_DEVIMR_PEP_6                       ( 0x1u << 18 )                        /**< \brief (USBHS_DEVIMR) Endpoint 6 Interrupt Mask */
#define USBHS_DEVIMR_PEP_7                       ( 0x1u << 19 )                        /**< \brief (USBHS_DEVIMR) Endpoint 7 Interrupt Mask */
#define USBHS_DEVIMR_PEP_8                       ( 0x1u << 20 )                        /**< \brief (USBHS_DEVIMR) Endpoint 8 Interrupt Mask */
#define USBHS_DEVIMR_PEP_9                       ( 0x1u << 21 )                        /**< \brief (USBHS_DEVIMR) Endpoint 9 Interrupt Mask */
#define USBHS_DEVIMR_PEP_10                      ( 0x1u << 22 )                        /**< \brief (USBHS_DEVIMR) Endpoint 10 Interrupt Mask */
#define USBHS_DEVIMR_PEP_11                      ( 0x1u << 23 )                        /**< \brief (USBHS_DEVIMR) Endpoint 11 Interrupt Mask */
#define USBHS_DEVIMR_DMA_1                       ( 0x1u << 25 )                        /**< \brief (USBHS_DEVIMR) DMA Channel 1 Interrupt Mask */
#define USBHS_DEVIMR_DMA_2                       ( 0x1u << 26 )                        /**< \brief (USBHS_DEVIMR) DMA Channel 2 Interrupt Mask */
#define USBHS_DEVIMR_DMA_3                       ( 0x1u << 27 )                        /**< \brief (USBHS_DEVIMR) DMA Channel 3 Interrupt Mask */
#define USBHS_DEVIMR_DMA_4                       ( 0x1u << 28 )                        /**< \brief (USBHS_DEVIMR) DMA Channel 4 Interrupt Mask */
#define USBHS_DEVIMR_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_DEVIMR) DMA Channel 5 Interrupt Mask */
