FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_usbhs.h
#define USBHS_HSTIFR_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_HSTIFR) DMA Channel 5 Interrupt Set */
#define USBHS_HSTIFR_DMA_6                       ( 0x1u << 30 )                        /**< \brief (USBHS_HSTIFR) DMA Channel 6 Interrupt Set */
#define USBHS_HSTIFR_DMA_7                       ( 0x1u << 31 )                        /**< \brief (USBHS_HSTIFR) DMA Channel 7 Interrupt Set */
/* -------- USBHS_HSTIMR : (USBHS Offset: 0x0410) Host Global Interrupt Mask Register -------- */
#define USBHS_HSTIMR_DCONNIE                     ( 0x1u << 0 )                         /**< \brief (USBHS_HSTIMR) Device Connection Interrupt Enable */
#define USBHS_HSTIMR_DDISCIE                     ( 0x1u << 1 )                         /**< \brief (USBHS_HSTIMR) Device Disconnection Interrupt Enable */
#define USBHS_HSTIMR_RSTIE                       ( 0x1u << 2 )                         /**< \brief (USBHS_HSTIMR) USB Reset Sent Interrupt Enable */
#define USBHS_HSTIMR_RSMEDIE                     ( 0x1u << 3 )                         /**< \brief (USBHS_HSTIMR) Downstream Resume Sent Interrupt Enable */
#define USBHS_HSTIMR_RXRSMIE                     ( 0x1u << 4 )                         /**< \brief (USBHS_HSTIMR) Upstream Resume Received Interrupt Enable */
#define USBHS_HSTIMR_HSOFIE                      ( 0x1u << 5 )                         /**< \brief (USBHS_HSTIMR) Host Start of Frame Interrupt Enable */
#define USBHS_HSTIMR_HWUPIE                      ( 0x1u << 6 )                         /**< \brief (USBHS_HSTIMR) Host Wake-Up Interrupt Enable */
#define USBHS_HSTIMR_PEP_0                       ( 0x1u << 8 )                         /**< \brief (USBHS_HSTIMR) Pipe 0 Interrupt Enable */
#define USBHS_HSTIMR_PEP_1                       ( 0x1u << 9 )                         /**< \brief (USBHS_HSTIMR) Pipe 1 Interrupt Enable */
#define USBHS_HSTIMR_PEP_2                       ( 0x1u << 10 )                        /**< \brief (USBHS_HSTIMR) Pipe 2 Interrupt Enable */
#define USBHS_HSTIMR_PEP_3                       ( 0x1u << 11 )                        /**< \brief (USBHS_HSTIMR) Pipe 3 Interrupt Enable */
#define USBHS_HSTIMR_PEP_4                       ( 0x1u << 12 )                        /**< \brief (USBHS_HSTIMR) Pipe 4 Interrupt Enable */
#define USBHS_HSTIMR_PEP_5                       ( 0x1u << 13 )                        /**< \brief (USBHS_HSTIMR) Pipe 5 Interrupt Enable */
#define USBHS_HSTIMR_PEP_6                       ( 0x1u << 14 )                        /**< \brief (USBHS_HSTIMR) Pipe 6 Interrupt Enable */
#define USBHS_HSTIMR_PEP_7                       ( 0x1u << 15 )                        /**< \brief (USBHS_HSTIMR) Pipe 7 Interrupt Enable */
#define USBHS_HSTIMR_PEP_8                       ( 0x1u << 16 )                        /**< \brief (USBHS_HSTIMR) Pipe 8 Interrupt Enable */
#define USBHS_HSTIMR_PEP_9                       ( 0x1u << 17 )                        /**< \brief (USBHS_HSTIMR) Pipe 9 Interrupt Enable */
#define USBHS_HSTIMR_PEP_10                      ( 0x1u << 18 )                        /**< \brief (USBHS_HSTIMR) Pipe 10 Interrupt Enable */
#define USBHS_HSTIMR_PEP_11                      ( 0x1u << 19 )                        /**< \brief (USBHS_HSTIMR) Pipe 11 Interrupt Enable */
#define USBHS_HSTIMR_DMA_1                       ( 0x1u << 25 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 1 Interrupt Enable */
#define USBHS_HSTIMR_DMA_2                       ( 0x1u << 26 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 2 Interrupt Enable */
#define USBHS_HSTIMR_DMA_3                       ( 0x1u << 27 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 3 Interrupt Enable */
#define USBHS_HSTIMR_DMA_4                       ( 0x1u << 28 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 4 Interrupt Enable */
#define USBHS_HSTIMR_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 5 Interrupt Enable */
#define USBHS_HSTIMR_DMA_6                       ( 0x1u << 30 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 6 Interrupt Enable */
#define USBHS_HSTIMR_DMA_7                       ( 0x1u << 31 )                        /**< \brief (USBHS_HSTIMR) DMA Channel 7 Interrupt Enable */
/* -------- USBHS_HSTIDR : (USBHS Offset: 0x0414) Host Global Interrupt Disable Register -------- */
#define USBHS_HSTIDR_DCONNIEC                    ( 0x1u << 0 )                         /**< \brief (USBHS_HSTIDR) Device Connection Interrupt Disable */
#define USBHS_HSTIDR_DDISCIEC                    ( 0x1u << 1 )                         /**< \brief (USBHS_HSTIDR) Device Disconnection Interrupt Disable */
#define USBHS_HSTIDR_RSTIEC                      ( 0x1u << 2 )                         /**< \brief (USBHS_HSTIDR) USB Reset Sent Interrupt Disable */
#define USBHS_HSTIDR_RSMEDIEC                    ( 0x1u << 3 )                         /**< \brief (USBHS_HSTIDR) Downstream Resume Sent Interrupt Disable */
#define USBHS_HSTIDR_RXRSMIEC                    ( 0x1u << 4 )                         /**< \brief (USBHS_HSTIDR) Upstream Resume Received Interrupt Disable */
#define USBHS_HSTIDR_HSOFIEC                     ( 0x1u << 5 )                         /**< \brief (USBHS_HSTIDR) Host Start of Frame Interrupt Disable */
#define USBHS_HSTIDR_HWUPIEC                     ( 0x1u << 6 )                         /**< \brief (USBHS_HSTIDR) Host Wake-Up Interrupt Disable */
#define USBHS_HSTIDR_PEP_0                       ( 0x1u << 8 )                         /**< \brief (USBHS_HSTIDR) Pipe 0 Interrupt Disable */
#define USBHS_HSTIDR_PEP_1                       ( 0x1u << 9 )                         /**< \brief (USBHS_HSTIDR) Pipe 1 Interrupt Disable */
#define USBHS_HSTIDR_PEP_2                       ( 0x1u << 10 )                        /**< \brief (USBHS_HSTIDR) Pipe 2 Interrupt Disable */
#define USBHS_HSTIDR_PEP_3                       ( 0x1u << 11 )                        /**< \brief (USBHS_HSTIDR) Pipe 3 Interrupt Disable */
#define USBHS_HSTIDR_PEP_4                       ( 0x1u << 12 )                        /**< \brief (USBHS_HSTIDR) Pipe 4 Interrupt Disable */
#define USBHS_HSTIDR_PEP_5                       ( 0x1u << 13 )                        /**< \brief (USBHS_HSTIDR) Pipe 5 Interrupt Disable */
#define USBHS_HSTIDR_PEP_6                       ( 0x1u << 14 )                        /**< \brief (USBHS_HSTIDR) Pipe 6 Interrupt Disable */
#define USBHS_HSTIDR_PEP_7                       ( 0x1u << 15 )                        /**< \brief (USBHS_HSTIDR) Pipe 7 Interrupt Disable */
#define USBHS_HSTIDR_PEP_8                       ( 0x1u << 16 )                        /**< \brief (USBHS_HSTIDR) Pipe 8 Interrupt Disable */
#define USBHS_HSTIDR_PEP_9                       ( 0x1u << 17 )                        /**< \brief (USBHS_HSTIDR) Pipe 9 Interrupt Disable */
#define USBHS_HSTIDR_PEP_10                      ( 0x1u << 18 )                        /**< \brief (USBHS_HSTIDR) Pipe 10 Interrupt Disable */
#define USBHS_HSTIDR_PEP_11                      ( 0x1u << 19 )                        /**< \brief (USBHS_HSTIDR) Pipe 11 Interrupt Disable */
#define USBHS_HSTIDR_DMA_1                       ( 0x1u << 25 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 1 Interrupt Disable */
#define USBHS_HSTIDR_DMA_2                       ( 0x1u << 26 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 2 Interrupt Disable */
#define USBHS_HSTIDR_DMA_3                       ( 0x1u << 27 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 3 Interrupt Disable */
#define USBHS_HSTIDR_DMA_4                       ( 0x1u << 28 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 4 Interrupt Disable */
#define USBHS_HSTIDR_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 5 Interrupt Disable */
#define USBHS_HSTIDR_DMA_6                       ( 0x1u << 30 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 6 Interrupt Disable */
#define USBHS_HSTIDR_DMA_7                       ( 0x1u << 31 )                        /**< \brief (USBHS_HSTIDR) DMA Channel 7 Interrupt Disable */
/* -------- USBHS_HSTIER : (USBHS Offset: 0x0418) Host Global Interrupt Enable Register -------- */
#define USBHS_HSTIER_DCONNIES                    ( 0x1u << 0 )                         /**< \brief (USBHS_HSTIER) Device Connection Interrupt Enable */
#define USBHS_HSTIER_DDISCIES                    ( 0x1u << 1 )                         /**< \brief (USBHS_HSTIER) Device Disconnection Interrupt Enable */
#define USBHS_HSTIER_RSTIES                      ( 0x1u << 2 )                         /**< \brief (USBHS_HSTIER) USB Reset Sent Interrupt Enable */
#define USBHS_HSTIER_RSMEDIES                    ( 0x1u << 3 )                         /**< \brief (USBHS_HSTIER) Downstream Resume Sent Interrupt Enable */
#define USBHS_HSTIER_RXRSMIES                    ( 0x1u << 4 )                         /**< \brief (USBHS_HSTIER) Upstream Resume Received Interrupt Enable */
#define USBHS_HSTIER_HSOFIES                     ( 0x1u << 5 )                         /**< \brief (USBHS_HSTIER) Host Start of Frame Interrupt Enable */
#define USBHS_HSTIER_HWUPIES                     ( 0x1u << 6 )                         /**< \brief (USBHS_HSTIER) Host Wake-Up Interrupt Enable */
#define USBHS_HSTIER_PEP_0                       ( 0x1u << 8 )                         /**< \brief (USBHS_HSTIER) Pipe 0 Interrupt Enable */
#define USBHS_HSTIER_PEP_1                       ( 0x1u << 9 )                         /**< \brief (USBHS_HSTIER) Pipe 1 Interrupt Enable */
#define USBHS_HSTIER_PEP_2                       ( 0x1u << 10 )                        /**< \brief (USBHS_HSTIER) Pipe 2 Interrupt Enable */
#define USBHS_HSTIER_PEP_3                       ( 0x1u << 11 )                        /**< \brief (USBHS_HSTIER) Pipe 3 Interrupt Enable */
#define USBHS_HSTIER_PEP_4                       ( 0x1u << 12 )                        /**< \brief (USBHS_HSTIER) Pipe 4 Interrupt Enable */
#define USBHS_HSTIER_PEP_5                       ( 0x1u << 13 )                        /**< \brief (USBHS_HSTIER) Pipe 5 Interrupt Enable */
#define USBHS_HSTIER_PEP_6                       ( 0x1u << 14 )                        /**< \brief (USBHS_HSTIER) Pipe 6 Interrupt Enable */
#define USBHS_HSTIER_PEP_7                       ( 0x1u << 15 )                        /**< \brief (USBHS_HSTIER) Pipe 7 Interrupt Enable */
#define USBHS_HSTIER_PEP_8                       ( 0x1u << 16 )                        /**< \brief (USBHS_HSTIER) Pipe 8 Interrupt Enable */
#define USBHS_HSTIER_PEP_9                       ( 0x1u << 17 )                        /**< \brief (USBHS_HSTIER) Pipe 9 Interrupt Enable */
#define USBHS_HSTIER_PEP_10                      ( 0x1u << 18 )                        /**< \brief (USBHS_HSTIER) Pipe 10 Interrupt Enable */
#define USBHS_HSTIER_PEP_11                      ( 0x1u << 19 )                        /**< \brief (USBHS_HSTIER) Pipe 11 Interrupt Enable */
#define USBHS_HSTIER_DMA_1                       ( 0x1u << 25 )                        /**< \brief (USBHS_HSTIER) DMA Channel 1 Interrupt Enable */
#define USBHS_HSTIER_DMA_2                       ( 0x1u << 26 )                        /**< \brief (USBHS_HSTIER) DMA Channel 2 Interrupt Enable */
#define USBHS_HSTIER_DMA_3                       ( 0x1u << 27 )                        /**< \brief (USBHS_HSTIER) DMA Channel 3 Interrupt Enable */
#define USBHS_HSTIER_DMA_4                       ( 0x1u << 28 )                        /**< \brief (USBHS_HSTIER) DMA Channel 4 Interrupt Enable */
#define USBHS_HSTIER_DMA_5                       ( 0x1u << 29 )                        /**< \brief (USBHS_HSTIER) DMA Channel 5 Interrupt Enable */
#define USBHS_HSTIER_DMA_6                       ( 0x1u << 30 )                        /**< \brief (USBHS_HSTIER) DMA Channel 6 Interrupt Enable */
#define USBHS_HSTIER_DMA_7                       ( 0x1u << 31 )                        /**< \brief (USBHS_HSTIER) DMA Channel 7 Interrupt Enable */
/* -------- USBHS_HSTPIP : (USBHS Offset: 0x0041C) Host Pipe Register -------- */
#define USBHS_HSTPIP_PEN0                        ( 0x1u << 0 )                         /**< \brief (USBHS_HSTPIP) Pipe 0 Enable */
#define USBHS_HSTPIP_PEN1                        ( 0x1u << 1 )                         /**< \brief (USBHS_HSTPIP) Pipe 1 Enable */
#define USBHS_HSTPIP_PEN2                        ( 0x1u << 2 )                         /**< \brief (USBHS_HSTPIP) Pipe 2 Enable */
#define USBHS_HSTPIP_PEN3                        ( 0x1u << 3 )                         /**< \brief (USBHS_HSTPIP) Pipe 3 Enable */
#define USBHS_HSTPIP_PEN4                        ( 0x1u << 4 )                         /**< \brief (USBHS_HSTPIP) Pipe 4 Enable */
#define USBHS_HSTPIP_PEN5                        ( 0x1u << 5 )                         /**< \brief (USBHS_HSTPIP) Pipe 5 Enable */
#define USBHS_HSTPIP_PEN6                        ( 0x1u << 6 )                         /**< \brief (USBHS_HSTPIP) Pipe 6 Enable */
#define USBHS_HSTPIP_PEN7                        ( 0x1u << 7 )                         /**< \brief (USBHS_HSTPIP) Pipe 7 Enable */
#define USBHS_HSTPIP_PEN8                        ( 0x1u << 8 )                         /**< \brief (USBHS_HSTPIP) Pipe 8 Enable */
#define USBHS_HSTPIP_PRST0                       ( 0x1u << 16 )                        /**< \brief (USBHS_HSTPIP) Pipe 0 Reset */
#define USBHS_HSTPIP_PRST1                       ( 0x1u << 17 )                        /**< \brief (USBHS_HSTPIP) Pipe 1 Reset */
#define USBHS_HSTPIP_PRST2                       ( 0x1u << 18 )                        /**< \brief (USBHS_HSTPIP) Pipe 2 Reset */
#define USBHS_HSTPIP_PRST3                       ( 0x1u << 19 )                        /**< \brief (USBHS_HSTPIP) Pipe 3 Reset */
#define USBHS_HSTPIP_PRST4                       ( 0x1u << 20 )                        /**< \brief (USBHS_HSTPIP) Pipe 4 Reset */
#define USBHS_HSTPIP_PRST5                       ( 0x1u << 21 )                        /**< \brief (USBHS_HSTPIP) Pipe 5 Reset */
#define USBHS_HSTPIP_PRST6                       ( 0x1u << 22 )                        /**< \brief (USBHS_HSTPIP) Pipe 6 Reset */
#define USBHS_HSTPIP_PRST7                       ( 0x1u << 23 )                        /**< \brief (USBHS_HSTPIP) Pipe 7 Reset */
#define USBHS_HSTPIP_PRST8                       ( 0x1u << 24 )                        /**< \brief (USBHS_HSTPIP) Pipe 8 Reset */
/* -------- USBHS_HSTFNUM : (USBHS Offset: 0x0420) Host Frame Number Register -------- */
#define USBHS_HSTFNUM_MFNUM_Pos                  0
#define USBHS_HSTFNUM_MFNUM_Msk                  ( 0x7u << USBHS_HSTFNUM_MFNUM_Pos ) /**< \brief (USBHS_HSTFNUM) Micro Frame Number */
#define USBHS_HSTFNUM_MFNUM( value )       ( ( USBHS_HSTFNUM_MFNUM_Msk & ( ( value ) << USBHS_HSTFNUM_MFNUM_Pos ) ) )
#define USBHS_HSTFNUM_FNUM_Pos                   3
#define USBHS_HSTFNUM_FNUM_Msk                   ( 0x7ffu << USBHS_HSTFNUM_FNUM_Pos ) /**< \brief (USBHS_HSTFNUM) Frame Number */
#define USBHS_HSTFNUM_FNUM( value )        ( ( USBHS_HSTFNUM_FNUM_Msk & ( ( value ) << USBHS_HSTFNUM_FNUM_Pos ) ) )
#define USBHS_HSTFNUM_FLENHIGH_Pos               16
#define USBHS_HSTFNUM_FLENHIGH_Msk               ( 0xffu << USBHS_HSTFNUM_FLENHIGH_Pos ) /**< \brief (USBHS_HSTFNUM) Frame Length */
#define USBHS_HSTFNUM_FLENHIGH( value )    ( ( USBHS_HSTFNUM_FLENHIGH_Msk & ( ( value ) << USBHS_HSTFNUM_FLENHIGH_Pos ) ) )
/* -------- USBHS_HSTADDR1 : (USBHS Offset: 0x0424) Host Address 1 Register -------- */
#define USBHS_HSTADDR1_HSTADDRP0_Pos             0
#define USBHS_HSTADDR1_HSTADDRP0_Msk             ( 0x7fu << USBHS_HSTADDR1_HSTADDRP0_Pos ) /**< \brief (USBHS_HSTADDR1) USB Host Address */
#define USBHS_HSTADDR1_HSTADDRP0( value )    ( ( USBHS_HSTADDR1_HSTADDRP0_Msk & ( ( value ) << USBHS_HSTADDR1_HSTADDRP0_Pos ) ) )
#define USBHS_HSTADDR1_HSTADDRP1_Pos             8
#define USBHS_HSTADDR1_HSTADDRP1_Msk             ( 0x7fu << USBHS_HSTADDR1_HSTADDRP1_Pos ) /**< \brief (USBHS_HSTADDR1) USB Host Address */
#define USBHS_HSTADDR1_HSTADDRP1( value )    ( ( USBHS_HSTADDR1_HSTADDRP1_Msk & ( ( value ) << USBHS_HSTADDR1_HSTADDRP1_Pos ) ) )
#define USBHS_HSTADDR1_HSTADDRP2_Pos             16
#define USBHS_HSTADDR1_HSTADDRP2_Msk             ( 0x7fu << USBHS_HSTADDR1_HSTADDRP2_Pos ) /**< \brief (USBHS_HSTADDR1) USB Host Address */
#define USBHS_HSTADDR1_HSTADDRP2( value )    ( ( USBHS_HSTADDR1_HSTADDRP2_Msk & ( ( value ) << USBHS_HSTADDR1_HSTADDRP2_Pos ) ) )
#define USBHS_HSTADDR1_HSTADDRP3_Pos             24
#define USBHS_HSTADDR1_HSTADDRP3_Msk             ( 0x7fu << USBHS_HSTADDR1_HSTADDRP3_Pos ) /**< \brief (USBHS_HSTADDR1) USB Host Address */
#define USBHS_HSTADDR1_HSTADDRP3( value )    ( ( USBHS_HSTADDR1_HSTADDRP3_Msk & ( ( value ) << USBHS_HSTADDR1_HSTADDRP3_Pos ) ) )
/* -------- USBHS_HSTADDR2 : (USBHS Offset: 0x0428) Host Address 2 Register -------- */
#define USBHS_HSTADDR2_HSTADDRP4_Pos             0
#define USBHS_HSTADDR2_HSTADDRP4_Msk             ( 0x7fu << USBHS_HSTADDR2_HSTADDRP4_Pos ) /**< \brief (USBHS_HSTADDR2) USB Host Address */
#define USBHS_HSTADDR2_HSTADDRP4( value )    ( ( USBHS_HSTADDR2_HSTADDRP4_Msk & ( ( value ) << USBHS_HSTADDR2_HSTADDRP4_Pos ) ) )
#define USBHS_HSTADDR2_HSTADDRP5_Pos             8
#define USBHS_HSTADDR2_HSTADDRP5_Msk             ( 0x7fu << USBHS_HSTADDR2_HSTADDRP5_Pos ) /**< \brief (USBHS_HSTADDR2) USB Host Address */
#define USBHS_HSTADDR2_HSTADDRP5( value )    ( ( USBHS_HSTADDR2_HSTADDRP5_Msk & ( ( value ) << USBHS_HSTADDR2_HSTADDRP5_Pos ) ) )
#define USBHS_HSTADDR2_HSTADDRP6_Pos             16
#define USBHS_HSTADDR2_HSTADDRP6_Msk             ( 0x7fu << USBHS_HSTADDR2_HSTADDRP6_Pos ) /**< \brief (USBHS_HSTADDR2) USB Host Address */
#define USBHS_HSTADDR2_HSTADDRP6( value )    ( ( USBHS_HSTADDR2_HSTADDRP6_Msk & ( ( value ) << USBHS_HSTADDR2_HSTADDRP6_Pos ) ) )
#define USBHS_HSTADDR2_HSTADDRP7_Pos             24
#define USBHS_HSTADDR2_HSTADDRP7_Msk             ( 0x7fu << USBHS_HSTADDR2_HSTADDRP7_Pos ) /**< \brief (USBHS_HSTADDR2) USB Host Address */
#define USBHS_HSTADDR2_HSTADDRP7( value )    ( ( USBHS_HSTADDR2_HSTADDRP7_Msk & ( ( value ) << USBHS_HSTADDR2_HSTADDRP7_Pos ) ) )
/* -------- USBHS_HSTADDR3 : (USBHS Offset: 0x042C) Host Address 3 Register -------- */
#define USBHS_HSTADDR3_HSTADDRP8_Pos             0
#define USBHS_HSTADDR3_HSTADDRP8_Msk             ( 0x7fu << USBHS_HSTADDR3_HSTADDRP8_Pos ) /**< \brief (USBHS_HSTADDR3) USB Host Address */
#define USBHS_HSTADDR3_HSTADDRP8( value )    ( ( USBHS_HSTADDR3_HSTADDRP8_Msk & ( ( value ) << USBHS_HSTADDR3_HSTADDRP8_Pos ) ) )
#define USBHS_HSTADDR3_HSTADDRP9_Pos             8
#define USBHS_HSTADDR3_HSTADDRP9_Msk             ( 0x7fu << USBHS_HSTADDR3_HSTADDRP9_Pos ) /**< \brief (USBHS_HSTADDR3) USB Host Address */
#define USBHS_HSTADDR3_HSTADDRP9( value )    ( ( USBHS_HSTADDR3_HSTADDRP9_Msk & ( ( value ) << USBHS_HSTADDR3_HSTADDRP9_Pos ) ) )
/* -------- USBHS_HSTPIPCFG[10] : (USBHS Offset: 0x500) Host Pipe Configuration Register (n = 0) -------- */
#define USBHS_HSTPIPCFG_ALLOC                    ( 0x1u << 1 )                          /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Memory Allocate */
#define USBHS_HSTPIPCFG_PBK_Pos                  2
#define USBHS_HSTPIPCFG_PBK_Msk                  ( 0x3u << USBHS_HSTPIPCFG_PBK_Pos )    /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Banks */
#define USBHS_HSTPIPCFG_PBK( value )    ( ( USBHS_HSTPIPCFG_PBK_Msk & ( ( value ) << USBHS_HSTPIPCFG_PBK_Pos ) ) )
#define   USBHS_HSTPIPCFG_PBK_1_BANK             ( 0x0u << 2 )                          /**< \brief (USBHS_HSTPIPCFG[10]) Single-bank pipe */
#define   USBHS_HSTPIPCFG_PBK_2_BANK             ( 0x1u << 2 )                          /**< \brief (USBHS_HSTPIPCFG[10]) Double-bank pipe */
#define   USBHS_HSTPIPCFG_PBK_3_BANK             ( 0x2u << 2 )                          /**< \brief (USBHS_HSTPIPCFG[10]) Triple-bank pipe */
#define USBHS_HSTPIPCFG_PSIZE_Pos                4
#define USBHS_HSTPIPCFG_PSIZE_Msk                ( 0x7u << USBHS_HSTPIPCFG_PSIZE_Pos )  /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Size */
#define USBHS_HSTPIPCFG_PSIZE( value )    ( ( USBHS_HSTPIPCFG_PSIZE_Msk & ( ( value ) << USBHS_HSTPIPCFG_PSIZE_Pos ) ) )
#define   USBHS_HSTPIPCFG_PSIZE_8_BYTE           ( 0x0u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 8 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_16_BYTE          ( 0x1u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 16 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_32_BYTE          ( 0x2u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 32 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_64_BYTE          ( 0x3u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 64 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_128_BYTE         ( 0x4u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 128 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_256_BYTE         ( 0x5u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 256 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_512_BYTE         ( 0x6u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 512 bytes */
#define   USBHS_HSTPIPCFG_PSIZE_1024_BYTE        ( 0x7u << 4 )                          /**< \brief (USBHS_HSTPIPCFG[10]) 1024 bytes */
#define USBHS_HSTPIPCFG_PTOKEN_Pos               8
#define USBHS_HSTPIPCFG_PTOKEN_Msk               ( 0x3u << USBHS_HSTPIPCFG_PTOKEN_Pos ) /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Token */
#define USBHS_HSTPIPCFG_PTOKEN( value )    ( ( USBHS_HSTPIPCFG_PTOKEN_Msk & ( ( value ) << USBHS_HSTPIPCFG_PTOKEN_Pos ) ) )
#define   USBHS_HSTPIPCFG_PTOKEN_SETUP           ( 0x0u << 8 )                          /**< \brief (USBHS_HSTPIPCFG[10]) SETUP */
#define   USBHS_HSTPIPCFG_PTOKEN_IN              ( 0x1u << 8 )                          /**< \brief (USBHS_HSTPIPCFG[10]) IN */
#define   USBHS_HSTPIPCFG_PTOKEN_OUT             ( 0x2u << 8 )                          /**< \brief (USBHS_HSTPIPCFG[10]) OUT */
#define USBHS_HSTPIPCFG_AUTOSW                   ( 0x1u << 10 )                         /**< \brief (USBHS_HSTPIPCFG[10]) Automatic Switch */
#define USBHS_HSTPIPCFG_PTYPE_Pos                12
#define USBHS_HSTPIPCFG_PTYPE_Msk                ( 0x3u << USBHS_HSTPIPCFG_PTYPE_Pos )  /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Type */
#define USBHS_HSTPIPCFG_PTYPE( value )    ( ( USBHS_HSTPIPCFG_PTYPE_Msk & ( ( value ) << USBHS_HSTPIPCFG_PTYPE_Pos ) ) )
#define   USBHS_HSTPIPCFG_PTYPE_CTRL             ( 0x0u << 12 )                         /**< \brief (USBHS_HSTPIPCFG[10]) Control */
#define   USBHS_HSTPIPCFG_PTYPE_ISO              ( 0x1u << 12 )                         /**< \brief (USBHS_HSTPIPCFG[10]) Isochronous */
#define   USBHS_HSTPIPCFG_PTYPE_BLK              ( 0x2u << 12 )                         /**< \brief (USBHS_HSTPIPCFG[10]) Bulk */
#define   USBHS_HSTPIPCFG_PTYPE_INTRPT           ( 0x3u << 12 )                         /**< \brief (USBHS_HSTPIPCFG[10]) Interrupt */
#define USBHS_HSTPIPCFG_PEPNUM_Pos               16
#define USBHS_HSTPIPCFG_PEPNUM_Msk               ( 0xfu << USBHS_HSTPIPCFG_PEPNUM_Pos ) /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Endpoint Number */
#define USBHS_HSTPIPCFG_PEPNUM( value )    ( ( USBHS_HSTPIPCFG_PEPNUM_Msk & ( ( value ) << USBHS_HSTPIPCFG_PEPNUM_Pos ) ) )
#define USBHS_HSTPIPCFG_INTFRQ_Pos               24
#define USBHS_HSTPIPCFG_INTFRQ_Msk               ( 0xffu << USBHS_HSTPIPCFG_INTFRQ_Pos )    /**< \brief (USBHS_HSTPIPCFG[10]) Pipe Interrupt Request Frequency */
#define USBHS_HSTPIPCFG_INTFRQ( value )    ( ( USBHS_HSTPIPCFG_INTFRQ_Msk & ( ( value ) << USBHS_HSTPIPCFG_INTFRQ_Pos ) ) )
#define USBHS_HSTPIPCFG_PINGEN                   ( 0x1u << 20 )                             /**< \brief (USBHS_HSTPIPCFG[10]) Ping Enable */
#define USBHS_HSTPIPCFG_BINTERVAL_Pos            24
