FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_usbhs.h
#define USBHS_TSTA1_SOFCntMa1_Msk                ( 0x7fu << USBHS_TSTA1_SOFCntMa1_Pos )  /**< \brief (USBHS_TSTA1) SOF Counter Max */
#define USBHS_TSTA1_SOFCntMa1( value )    ( ( USBHS_TSTA1_SOFCntMa1_Msk & ( ( value ) << USBHS_TSTA1_SOFCntMa1_Pos ) ) )
#define USBHS_TSTA1_LoadSOFCnt                   ( 0x1u << 31 )                          /**< \brief (USBHS_TSTA1) Load SOF Counter */
/* -------- USBHS_TSTA2 : (USBHS Offset: 0x0814) General Test A2 Register -------- */
#define USBHS_TSTA2_FullDetachEn                 ( 0x1u << 0 )                           /**< \brief (USBHS_TSTA2) Full Detach Enable */
#define USBHS_TSTA2_HSSerialMode                 ( 0x1u << 1 )                           /**< \brief (USBHS_TSTA2) HS Serial Mode */
#define USBHS_TSTA2_LoopBackMode                 ( 0x1u << 2 )                           /**< \brief (USBHS_TSTA2) Loop-back Mode */
#define USBHS_TSTA2_DisableGatedClock            ( 0x1u << 3 )                           /**< \brief (USBHS_TSTA2) Disable Gated Clock */
#define USBHS_TSTA2_ForceSuspendMTo1             ( 0x1u << 4 )                           /**< \brief (USBHS_TSTA2) Force SuspendM to 1 */
#define USBHS_TSTA2_ByPassDpll                   ( 0x1u << 5 )                           /**< \brief (USBHS_TSTA2) Bypass DPLL */
#define USBHS_TSTA2_HostHSDisconnectDisable      ( 0x1u << 6 )                           /**< \brief (USBHS_TSTA2) Host HS Disconnect Disable */
#define USBHS_TSTA2_ForceHSRst_50ms              ( 0x1u << 7 )                           /**< \brief (USBHS_TSTA2) Force HS Reset to 50 ms */
#define USBHS_TSTA2_RemovePUWhenTX               ( 0x1u << 9 )                           /**< \brief (USBHS_TSTA2) Remove Pull-up When TX */
/* -------- USBHS_VERSION : (USBHS Offset: 0x0818) General Version Register -------- */
#define USBHS_VERSION_VERSION_Pos                0
#define USBHS_VERSION_VERSION_Msk                ( 0xfffu << USBHS_VERSION_VERSION_Pos ) /**< \brief (USBHS_VERSION) Version Number */
#define USBHS_VERSION_MFN_Pos                    16
#define USBHS_VERSION_MFN_Msk                    ( 0xfu << USBHS_VERSION_MFN_Pos )       /**< \brief (USBHS_VERSION) Metal Fix Number */
/* -------- USBHS_FSM : (USBHS Offset: 0x082C) General Finite State Machine Register -------- */
#define USBHS_FSM_DRDSTATE_Pos                   0
#define USBHS_FSM_DRDSTATE_Msk                   ( 0xfu << USBHS_FSM_DRDSTATE_Pos ) /**< \brief (USBHS_FSM) Dual Role Device State */
#define   USBHS_FSM_DRDSTATE_A_IDLESTATE         ( 0x0u << 0 )                      /**< \brief (USBHS_FSM) This is the start state for A-devices (when the ID pin is 0) */
#define   USBHS_FSM_DRDSTATE_A_WAIT_VRISE        ( 0x1u << 0 )                      /**< \brief (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V). */
#define   USBHS_FSM_DRDSTATE_A_WAIT_BCON         ( 0x2u << 0 )                      /**< \brief (USBHS_FSM) In this state, the A-device waits for the B-device to signal a connection. */
#define   USBHS_FSM_DRDSTATE_A_HOST              ( 0x3u << 0 )                      /**< \brief (USBHS_FSM) In this state, the A-device that operates in Host mode is operational. */
#define   USBHS_FSM_DRDSTATE_A_SUSPEND           ( 0x4u << 0 )                      /**< \brief (USBHS_FSM) The A-device operating as a host is in the Suspend mode. */
#define   USBHS_FSM_DRDSTATE_A_PERIPHERAL        ( 0x5u << 0 )                      /**< \brief (USBHS_FSM) The A-device operates as a peripheral. */
#define   USBHS_FSM_DRDSTATE_A_WAIT_VFALL        ( 0x6u << 0 )                      /**< \brief (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V). */
#define   USBHS_FSM_DRDSTATE_A_VBUS_ERR          ( 0x7u << 0 )                      /**< \brief (USBHS_FSM) In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state. */
#define   USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE    ( 0x8u << 0 )                      /**< \brief (USBHS_FSM) In this state, the A-device waits for the data USB line to discharge (100 us). */
#define   USBHS_FSM_DRDSTATE_B_IDLE              ( 0x9u << 0 )                      /**< \brief (USBHS_FSM) This is the start state for B-device (when the ID pin is 1). */
#define   USBHS_FSM_DRDSTATE_B_PERIPHERAL        ( 0xAu << 0 )                      /**< \brief (USBHS_FSM) In this state, the B-device acts as the peripheral. */
#define   USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP    ( 0xBu << 0 )                      /**< \brief (USBHS_FSM) In this state, the B-device is in Suspend mode and waits until 3 ms before initiating the HNP protocol if requested. */
#define   USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE    ( 0xCu << 0 )                      /**< \brief (USBHS_FSM) In this state, the B-device waits for the data USB line to discharge (100 us)) before becoming Host. */
#define   USBHS_FSM_DRDSTATE_B_WAIT_ACON         ( 0xDu << 0 )                      /**< \brief (USBHS_FSM) In this state, the B-device waits for the A-device to signal a connect before becoming B-Host. */
#define   USBHS_FSM_DRDSTATE_B_HOST              ( 0xEu << 0 )                      /**< \brief (USBHS_FSM) In this state, the B-device acts as the Host. */
#define   USBHS_FSM_DRDSTATE_B_SRP_INIT          ( 0xFu << 0 )                      /**< \brief (USBHS_FSM) In this state, the B-device attempts to start a session using the SRP protocol. */

/*@}*/


#endif /* _SAMV71_USBHS_COMPONENT_ */
